import string
import random

# Random ascii code 1000 and delete string.printable
#def randomText():
    #text_for_swap = set(chr(i) for i in range(1000)) - set(string.printable)
    #text_for_swap = random.sample(text_for_swap,100)
    #return list(text_for_swap)

# I don't know how to remove \u and \x from list then I do hard code
'''
def text_to_random():
    all_text_for_random = ['Ϡ', 'ȅ', 'ū', 'ɾ', '̰', 'ɰ', 'ͅ', 'Ũ', 'Ò', 'é', 'ˮ', 'ʪ', 'ξ', '˧', 'ʲ', 'ͭ', 
    'ɇ', 'ĕ', 'ϓ', 'ň', 'Ƕ', 'ȳ', '˅', 'Ɲ', 'ȹ', 'ʙ', 'ͣ', '¤', 'ˁ', 'Ⱦ', 'Ɠ', 'ψ', 'ƙ', 'ȫ', 'ę', 
    'Ȗ', 'ţ', 'ì', 'ă', '̜', '̣','Σ', 'Ⱥ', '͕', '̕', '΄', 'ï', '˚', '͡', 'ǳ', 'ɕ', 'ǂ', 'â', 'ȍ', 'í', 
    'ɉ', 'ɏ', 'ɩ', 'ʈ', 'ˆ', '̞', 'ο', 'ͱ', 'ǈ', '̠', '̨', 'ǐ', 'Ÿ', '͜', 'Ϙ', 'Ė', 'ˍ', 'ɻ', 'ē', 'Ǒ',
    '̉', 'ʆ', '̈', '˽', '˖', 'Ï', 'ī', '̭', 'Ņ', 'α', 'Ý', 'Ǭ', '̘', '͚', '̿', 'ě', 'ř', 'ɵ', 'ʼ', 'ϟ', 
    'Ʀ', 'ϙ', '̼', 'Ƶ', '°', '˒', 'η', 'ĉ', 'ȑ', 'Ń', '͋', 'ȁ', 'Ō', 'ȵ', 'ơ', 'ʍ', '·', 'ό', 'Ȝ', 'ʏ',
    'Ͷ', '¢', 'ʽ', 'Ƣ', 'ƣ', 'ű', 'ƾ', 'Ų', '˱', 'ų', '͖', 'ʨ', 'ą', 'ǔ', '˝', 'ͽ', '˪', '̟', 'Ϛ', 'ʂ',
    'ǖ', 'Ƚ', 'Ū', 'ç', 'Ǯ', 'ɧ', 'ʩ', 'Ȉ', '̚', '͞', 'ͺ', 'ð', '˾', 'ĵ', 'ț', 'ɽ', '©', 'ǧ', 'ʘ', 'ƨ',
    'ʒ', '͇', '̳', 'ō', 'Ί', 'ô', '˻', 'ɀ', 'ǎ', 'Ó', 'ƫ', 'ɞ', 'ȩ', '̗', 'Ά', 'ȴ', 'ɝ', 'ι', 'ȗ', 'ŵ','ȡ', 
    'Æ', 'Χ','ñ', 'ɛ', 'Ƨ', 'ɶ', 'ή', 'ϛ', 'Ě', 'ť', 'Ĕ', 'ǆ', '̡', 'ľ', 'Â', 'ʗ', 'ł', 'ĭ', 'Ɣ', 'Κ', 'Ş',
    'Ć', 'Ɖ', 'Į', 'ɑ', 'ǡ', 'Ƌ', 'ɭ', '˂', '͆', 'ˉ', 'ö', 'Ǘ', '̋', 'ʠ', 'ȉ', 'ͻ', 'ȱ', '§', 'Ñ', 'Ț', 'Ȱ',
    'ƍ', 'Ȑ', 'ʱ', 'Ù', 'ā', '˷', 'Û', '͉', 'Ƽ', '͍', ';', 'Ŋ', 'ʾ', 'ǥ', 'ʢ', 'ǩ', 'ɍ', 'Ű', '͢', '̄', 'Ο', 
    'Ϟ', 'À', 'Ψ', 'ϧ', 'ͬ', '̝', 'Λ', 'ʕ', 'Ώ', 'Ǜ', 'ώ', 'Ȫ', 'ɗ', 'ɡ', 'ũ', '˿', '΅', 'Ϋ', 'ſ', 'ʧ', 'ǌ',
    'Ȩ', 'ǁ', 'Ǉ', 'Ɓ', '˯', '́', 'Μ', 'ˌ', 'ȸ', 'Ϧ', 'ù', 'Ť', 'ɷ', 'ŋ', 'Ε', 'Ģ', '˺', 'ÿ', 'Ő', '̥', '̓',
    'ʶ', 'Ɗ', '½', 'Ǚ', 'ʛ', 'ư', 'Ɍ', 'Ϊ', '̬', 'ȭ', 'ƒ', 'Ƅ', '˦', 'Ơ', 'ǜ', 'Þ', 'ω', 'ʇ', 'Ň', '̐', 'ʬ', 
    'Ϥ', 'ȥ', 'Ķ', 'Ǔ', 'Ů', 'Ư', 'ŀ', 'ǚ', 'ʚ', 'ŷ', 'Ȅ', 'Ë', 'ˎ', 'ʮ', 'ŏ', 'Ƙ', 'ƈ', 'ͦ', 'ğ', 'Ą', '˳', 
    'Ȕ', 'Ɇ', 'ν', '͏', 'ˤ', 'Ľ', 'Ŭ', 'ƹ', 'Ͱ', 'Ã', 'ʌ', 'Ǿ', '¯', '̓', 'Ȇ', 'Ȯ', 'ș', '͙', 'Ɯ', 'ĺ', 'ɫ', '̴',
    '̵', 'θ', 'Ɵ', 'Ǣ', 'ˢ', 'Ƈ', 'ǟ', '˃', '̫', 'ƥ', 'Β', 'Ȋ', 'ʓ', 'Ĩ', 'Ǟ', 'Ř', 'Ē', 'ƅ', 'ĳ', 'ƶ', 'ȋ', 'ͫ', 
    'ĸ', '¶', 'ǝ', 'ǃ', 'ʡ', 'ˑ', '˩', '̔', 'ˡ', 'Á', '̦', 'Ͳ', 'Ħ', 'ɳ', 'ı', '˕', 'ɨ', '˼', 'Î', '͔', 'λ', 'ɿ',
    '²', 'Έ', 'ɪ', 'ɬ', 'ͳ', 'ϝ', 'Ȥ', '͂', 'Ǥ', 'ė', 'ύ', '̺', 'ϐ', 'ć', 'Í', 'Ƴ', 'ϗ', 'ǉ', 'ü', '«', 'ͷ', 'Ô', 
    'Ʃ', 'ˇ', '˨', '̆', 'Ǖ', 'ˀ', '̷', 'ß', 'Ŏ', 'ʋ', 'Ή','¼', 'ȣ', 'Ʌ','ê', '͟', '̀', 'Ĳ', 'Œ', '˭', 'ϒ', 'ɱ', 'ƀ', 
    'ʥ', '˄', 'Α', 'Ƞ', 'β', 'ɹ', 'ɂ', 'Ƀ', 'ͤ', 'ʳ', 'Ĥ', 'Ǝ', 'ń', 'Ɋ', 'Ƭ', 'ʵ', 'ɺ', 'Ĝ', 'Υ', 'ź', 'ϥ', 'ɯ', 'ʔ', '̛'
    , 'ʊ', 'Ŷ', '̂', 'Ȧ', '£', '͓', 'Ǻ', 'ɠ', 'ú', 'ȏ', '˵', 'ȇ', 'Ɨ', 'ȕ', '̢', '̇', '˜', 'ʅ', 'ď', 'ǭ', 'ί', 'ž', '˲', '͑', '̯', 
    'Ȏ', '³', 'è', 'Ž', 'ǒ', '·', 'ͧ', 'ƪ', '͠', 'ȯ', 'ͥ', 'ǹ', 'İ', 'ˬ', 'ʫ', 'ˋ', 'Ζ', 'ʐ', 'ɔ', 'Ļ', 'ŕ', 'ρ', 'ş', 'ɴ', 'ʹ', '×', '̀', '˛', 'Ƃ', 'ˠ', 'ǽ', 'Γ', '̤', '˥', 'ʴ', 'Ρ', 'Ɩ', 'µ', '̶', 'ɦ', 'ë', '˙', 'Ɉ', '˗', 'Ǽ', 'Ȟ', 'ȟ'
    , 'į', 'ɘ', 'έ', 'ʰ', 'Ν', 'ƕ', 'õ', 'Ç', 'ġ', 'ȝ', 'ʖ', 'ϑ', 'Θ', 'Ǵ', '¾', 'Ā', 'ǿ', 'Ɂ', 'Ġ', 'ʭ', 'Ď', 'Π', 'ΐ', 'υ', 'ļ', '̈́', 'ý', 'ʷ', 'ʄ', 'ǅ', '¥', 'Τ', '´', 'ã', '͗', 'ʯ', 'ƴ', 'π', 'Ɔ',
    'Ǹ', 'ä', 'ø', 'ʸ', 'ͩ', 'ƚ', 'ƭ', 'î', 'Η', '˹', 'Ύ', 'ʞ', 'ʜ', 'Ǆ', '¸', 'Ğ', 'ŝ', '̒', 'ΰ', '̎', 'ǰ', '̍', 'á', 'ƽ', 'ɤ', '̲', 'Ö', 'ĝ', 'ǯ', 'ȃ', 'Š', '́', 'Ü', '¨', '͛', 'Ī',
    'ņ', 'ŉ', 'È', '̊', '˘', 'ɢ', 'Ϗ', '̖', 'Δ', 'đ', 'ʟ', 'ª', 'ǲ', '̪', 'Õ', 'ͨ', '̽', 'Ȍ', '͈', 'ƞ', 'Ǐ', '̩', 'γ', 'ˣ', 'ʝ', 'ͪ', '¹', 'ɓ', 'φ', 'Ι', 'χ', 'ƃ', 'Φ', 'ɥ', 
    'Ȓ', 'ʣ', 'å', 'Ċ', 'Ð', '˓', 'Ǌ', '̾', 'ζ', 'ĥ', 'ò', 'ȧ', '͒', 'κ', '¦', 'Ŧ', 'Ś', 'ŧ', '͌', 'Ă', '®', 'û', 'Ȁ', 'ȓ', 'Ĭ', 'Ɏ', 'ɸ', 'ʁ', 'ȷ', '̱', 'Ê', 'ɖ', 'Ø', 'Ú', 
    'æ', 'č', 'Ǎ', '˰', '͊', 'Ȼ', '͘', '̅', 'ϣ', 'ς', 'Č', 'ǻ', 'ˈ', 'Ω', 'ʑ', 'à', 'Ƿ', 'μ', 'Ŕ', 'ϔ', 'Ŗ', 'ǫ', 'ʃ', 'Ƹ', 'ɒ', 'ͼ', '̃', 'ĩ', 'ɟ', 'Ʒ', 'Ʈ', '̻', 'ʉ', 'δ', 'ȼ', 'Ǩ', 'š', '͝',
    'Ǳ', 'Ɛ', 'ȶ', 'ɲ', 'ʹ', 'ƻ', 'ʺ', 'þ', '̸', 'ͯ', 'ά', 'τ', 'ϖ', 'Ϣ', '˞', '̌', 'Ĺ','Đ', 'ǀ', 'ķ', 'ƿ', 'ʻ', 'Ό', 'ˊ', 'ɜ', '̧', 'ͮ', 'Ϳ', 'ő', 'Ə', 'ƛ', 'Ǧ', 'ɐ', '͎', 'Ä', 'º', 'ȿ', 
    'Ź', 'Ƥ', 'ϊ', 'ʤ', '˫', 'ɼ', 'ƺ', '˔', 'ż', 'Ĵ', 'Ȳ', 'ʀ', 'ʎ', '̙', 'Ŀ', 'ó', 'ɋ', 'Ϝ', '¡','ʦ', 'Ȣ', 'ƌ', 'ʿ', 'ǋ', '˟', 'σ', 'ɚ', '±', '¬', 'É', 'ǵ', 'ģ', 'ǣ', 'Ż', 'Ʉ', '̑', 'Ŵ', 'ɮ'
    , 'ː', 'ś', 'ϕ', '÷', 'Ƒ', '̮', 'Ţ', 'Ŝ', 'Ș', 'œ', 'Å', 'Ǫ', '˸', 'Ξ', 'ϋ', 'Ȭ', 'ů', '͵', '̹', '¿', 'ŗ', 'Ȃ', '̏', 'Ʊ', 'Ì', 'ǘ', 'ε', 'Ǡ', 'ŭ', '»', 'ə', 'Ę', 'ɣ', 'Ʋ', 
    'ϡ', 'ċ', 'ħ', '˶', 'ˏ', '˴', 'Ĉ', 'Ł']
    all_text_for_random = random.sample(all_text_for_random,180)
    return all_text_for_random
'''

# Text for replace with normal text
def all_text_for_swap():
    text_for_swap = ['Ϝ', 'ϊ', 'ɡ', 'π', 'ʢ', 'ȡ', 'γ', 'Ȑ', 'ġ', 'Ǌ', 'Ȗ', 'ǣ', 'î', 'ƙ', 'ƛ', 'ǆ', 'ß', '͵', 'Ű', 
                     '¯', 'ˎ', 'ˢ', 'ξ', 'ʽ', 'ǧ', 'ŕ', 'ɾ', 'ƥ', 'Ɨ', '̃', 'ˊ', 'ˌ', '˨', 'ʀ', 'ʙ', '͜', 'ˏ', 'ɮ', '®', 
                     'Ʉ', 'ǹ', 'Ƒ', 'ÿ', '͉', 'Ō', 'Ǔ', 'ɭ', 'ͣ', 'ƶ', 'ƴ', 'Ğ', 'Ā', 'ɼ', 'Ò', 'ǿ', 'ʔ', 'Ǿ', 'Ǽ', 'Ƽ', 
                     '̉', 'ũ', '˓', 'ˆ', 'Ƥ', 'Ŏ', 'ɶ', 'ǋ', 'ͦ', 'ʗ', 'δ', 'Ǘ', '͇', 'Ư', '̞', 'ɒ', 'Ļ', 'ɽ', '͔', 'ʿ', 'Ɵ', 
                     '͗', '¸', 'Ģ', 'Æ', '×', 'ʸ', 'Ç', 'Ë', 'Ƴ', 'ˮ', 'ȿ', 'ț', 'ǰ', '¡', 'ʺ', 'ǵ', 'ʐ', 'Ǎ', 'ɐ', '̴', 'ˇ', 
                     'ń', 'ǯ', 'ǚ', 'ʇ', 'Ų', 'Ϥ', 'ή', 'ϒ', '̢', 'ϝ', '͞', 'Ǹ', 'Ǉ', 'Ś', 'č', 'Ĥ', '͛', 'ɱ', 'ș', '˞', 'Δ', 
                     'Ɂ', '˙', 'Ω', '̝', 'Ȋ', '̆', 'Ȧ', 'ğ', '˾', '˱', 'Ƨ', 'Ŗ', '̖', 'Õ', '¢', '͈', '̈', 'ø', 'ͬ', 'ĕ', '̮', '̇', 
                     'ɑ', '͙', 'Ƅ', 'μ', 'ƅ', 'ɿ', 'ϙ', '̕', 'ì', 'ł', 'ȑ', 'ż', 'ͮ', '¿', 'ύ', 'ϓ', 'ħ', '˽', 'ɘ', 'ͥ', '˪', 
                     'Ź', 'ǟ', '͏', 'η', 'ĝ', 'Ĺ', 'º', 'é', '́', '̡', 'ŏ', 'ɖ', '͠', 'ü', '˰', 'ϕ', 'Ŕ', 'ɻ', 'ƿ', 'Ȫ', 'ǎ', 'Ȼ']
    return text_for_swap

# Normal text on keyboard
def printableText():
    return string.printable

# Thailand text on keyboard
def thai_text():
    thai_text = [chr(i) for i in range(3585,3675+1)]
    thai_text.pop(thai_text.index('\u0e3b'))
    thai_text.pop(thai_text.index('\u0e3c'))
    thai_text.pop(thai_text.index('\u0e3d'))
    thai_text.pop(thai_text.index('\u0e3e'))
    return thai_text

# Append Thai Text and Normal Text in the same list
def all_keyboard_text():
    thai_keyboard_text = thai_text()
    english_keyboard_text = printableText()
    keyboard_text = list(english_keyboard_text) + list(thai_keyboard_text)
    return keyboard_text

# Random text for insert to mid index of text
def random_text_to_insert():
    text_for_swap = all_text_for_swap()
    raninsert = random.choice(text_for_swap)
    return raninsert


